chat_system_885053527_actor_description=Priest Owein. Senior Priest.
chat_system_885053527_snap_2_question=^?^Yes, we have a job for you. Listen carefully; it will be a long story.<br><br>One day one of the village boys was bitten by a vampire. Usually children do not survive such bites, but his parents asked a witch to do everything she could. And so the witch cast a curse on the boy, it helped him to survive, but his blood remained poisoned, black as night.<br>This horrified his relatives and they disowned their son and brought him to our Temple. Here we looked after the poor child for several years, and gave him the name - Enemen, which means "saved." The boy grew up, but became a true monster. He ate animals and birds alive, refused to pray, and read forbidden books in the library.
chat_system_885053527_snap_2_answer_0=^?^(Listen further...)
chat_system_885053527_snap_3_question=^?^We were trying to bring him to reason, offering prayers, but... So we struggled with this terrible situation, until one day a whole troop of orcs appeared out of nowhere. All the monks took cover in the main tower, but the boy was not scared. He broke away and ran towards them.<br>The monks do not know what they talked about, but they saw the boy lead them towards the grave of General Karador, the famous killer. The orcs did not spend much time there and went away soon. But when we visited the site, we found the grave dug up and empty.
chat_system_885053527_snap_3_answer_0=^?^What about that boy, that Enemen?
chat_system_885053527_snap_0_question=^?^At first we thought that the orcs took him with them or killed him, but we later learned that he found shelter at the deserted Castle Karmag, which stands here at the cemetery.<br>He even managed to subdue the undead creatures there, even the proud vampires. We have become worried about his power. So we sent several people to him, but he killed all of them.<br>Could you please set him back on the right path, or if this is truly impossible, then kill this accursed child?<br>[reward]
chat_system_885053527_snap_0_answer_0=^?^I'm willing to try. If anything happens, I'll scare him a little as a warning. Where can I find this castle?
chat_system_885053527_snap_0_answer_1=^?^You took him upon yourself; if you feel you must, then kill him on your own.
chat_system_885053527_snap_1_question=^?^Go to the south coast. Karmag is located near the sea.
chat_system_885053527_snap_1_answer_0=^?^Excellent! Let's go!
